practiceapp/app/controllers/articles_controller.rb

   def show
    @article=Article.all
---
SELECT "articles".* FROM "articles"

    def showid
        @article=Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create

        @article= Article.new(params.require(:article).permit(:title, :description, :price, :author))
        if @article.save
---
INSERT INTO "articles" ("title", "description", "price", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "dasfdsdsads"], ["description", "asfsgdsgds"], ["price", 2323], ["author", "dsdsds"], ["created_at", "2023-08-14 06:34:05.360555"], ["updated_at", "2023-08-14 06:34:05.360555"]]