practiceapp/app/controllers/new_controller.rb

   def mainpage
    @article = Article.all()
---
SELECT "articles".* FROM "articles"