copyapp/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "dcvxxcvxcvcx"], ["price", nil], ["description", "fasdfdsdfsdsf"], ["created_at", "2023-08-17 11:10:23.801130"], ["updated_at", "2023-08-17 11:10:23.801130"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "asdcasdsadssa"], ["updated_at", "2023-08-10 07:26:27.686834"], ["id", 3]]